ANSHAD134/STM32-Notes/STM32 codes/LED_Blink/Inc/stm32_f446xxSPI.h
/*
 * stm32_f446xxSPI.h
 *
 *  Created on: Nov 24, 2025
 *      Author: HP
 */

#ifndef STM32_F446XXSPI_H_
#define STM32_F446XXSPI_H_

/*
 * SPI BASE ADDRESS (APB1 and APB2 Bus)
 */
#define SPI1_BASEADDR		0x40013000U
#define SPI4_BASEADDR		0x40013400U
#define SPI2_BASEADDR		0x40003800U
#define SPI3_BASEADDR		0x40003C00U

/*
 * SPI REGISTER STRUCTURE
 */

typedef struct
{
	volatile uint32_t SPI_CR1;		//SPI CONTROL REGISTER 1 			(0x00)
	volatile uint32_t SPI_CR2;		//SPI CONTROL REGISTER 2 			(0x04)
	volatile uint32_t SPI_SR;		//SPI STATUS REGISTER 	 			(0x08)
	volatile uint32_t SPI_DR;		//SPI DATA REGISTER		 			(0x0C)
	volatile uint32_t SPI_CRCPR;	//SPI CRC POLYNOMIAL REGISTER		(0x10)
	volatile uint32_t SPI_RXCRCR;	//SPI RX CRC REGISTER				(0x14)
	volatile uint32_t SPI_TXCRCR;	//SPI TX CRC REGISTER				(0x18)
	volatile uint32_t SPI_I2SCFGR;	//SPI I2S CONFIGURATION REGISTER 	(0x1C)
	volatile uint32_t SPI_I2SPR;	//SPI I2S PRESCALER REGISTER		(0x20)
} SPI_RegDef_t;

/*
 * SPI POINTERS
 */

#define SPI1		((SPI_RegDef_t*)SPI1_BASEADDR)
#define SPI4		((SPI_RegDef_t*)SPI4_BASEADDR)
#define SPI2		((SPI_RegDef_t*)SPI2_BASEADDR)
#define SPI3		((SPI_RegDef_t*)SPI3_BASEADDR)

/*
 *RCC BASE ADDRESS (APB1 and APB2 Bus)
 */

#define RCC_BASEADDR		0x40023800U

/*
 * RCC REGISTER STRUCTURE
 */
typedef struct
	{
		volatile uint32_t CR;            // RCC clock control register                    (0x00)
	    volatile uint32_t PLLCFGR;       // RCC PLL configuration register                (0x04)
	    volatile uint32_t CFGR;          // RCC clock configuration register              (0x08)
	    volatile uint32_t CIR;           // RCC clock interrupt register                  (0x0C)
	    volatile uint32_t AHB1RSTR;      // RCC AHB1 peripheral reset register            (0x10)
	    volatile uint32_t AHB2RSTR;      // RCC AHB2 peripheral reset register            (0x14)
	    volatile uint32_t AHB3RSTR;      // RCC AHB3 peripheral reset register            (0x18)
	    volatile uint32_t RESERVED0;     // Reserved                                      (0x1C)
	    volatile uint32_t APB1RSTR;      // RCC APB1 peripheral reset register            (0x20)
	    volatile uint32_t APB2RSTR;      // RCC APB2 peripheral reset register            (0x24)
	    volatile uint32_t RESERVED1[2];  // Reserved                                      (0x28-0x2C)
	    volatile uint32_t AHB1ENR;       // RCC AHB1 peripheral clock enable register     (0x30)
	    volatile uint32_t AHB2ENR;       // RCC AHB2 peripheral clock enable register     (0x34)
	    volatile uint32_t AHB3ENR;       // RCC AHB3 peripheral clock enable register     (0x38)
	    volatile uint32_t RESERVED2;     // Reserved                                      (0x3C)
	    volatile uint32_t APB1ENR;       // RCC APB1 peripheral clock enable register     (0x40)
	    volatile uint32_t APB2ENR;       // RCC APB2 peripheral clock enable register     (0x44)
	    volatile uint32_t RESERVED3[2];  // Reserved                                      (0x48-0x4C)
	    volatile uint32_t AHB1LPENR;     // RCC AHB1 peripheral clock enable in low power (0x50)
	    volatile uint32_t AHB2LPENR;     // RCC AHB2 peripheral clock enable in low power (0x54)
	    volatile uint32_t AHB3LPENR;     // RCC AHB3 peripheral clock enable in low power (0x58)
	    volatile uint32_t RESERVED4;     // Reserved                                      (0x5C)
	    volatile uint32_t APB1LPENR;     // RCC APB1 peripheral clock enable in low power (0x60)
	    volatile uint32_t APB2LPENR;     // RCC APB2 peripheral clock enable in low power (0x64)
	    volatile uint32_t RESERVED5[2];  // Reserved                                      (0x68-0x6C)
	    volatile uint32_t BDCR;          // RCC Backup domain control register            (0x70)
	    volatile uint32_t CSR;           // RCC clock control & status register           (0x74)
	    volatile uint32_t RESERVED6[2];  // Reserved                                      (0x78-0x7C)
	    volatile uint32_t SSCGR;         // RCC spread spectrum clock generation register (0x80)
	    volatile uint32_t PLLI2SCFGR;    // RCC PLLI2S configuration register             (0x84)
	    volatile uint32_t PLLSAICFGR;    // RCC PLLSAI configuration register             (0x88)
	    volatile uint32_t DCKCFGR;       // RCC Dedicated Clocks configuration register   (0x8C)
	    volatile uint32_t CKGATENR;      // RCC clocks gated enable register              (0x90)
	    volatile uint32_t DCKCFGR2;      // RCC Dedicated Clocks configuration register 2 (0x94)
} RCC_RegDef_t;

/*
 * RCC POINTERS
 */

#define RCC		 ((RCC_RegDef_t*)RCC_BASEADDR)

/*
 * CLOCK ENABLE MACROS (APB1 and APB2 Bus for SPI)
 */

#define SPI1_CLK_EN()	(RCC->APB2ENR |= (1<<12))
#define SPI4_CLK_EN()	(RCC->APB2ENR |= (1<<13))
#define SPI2_CLK_EN()	(RCC->APB1ENR |= (1<<14))
#define SPI3_CLK_EN()	(RCC->APB1ENR |= (1<<15))


#endif /* STM32_F446XXSPI_H_ */
